locations = [
    {
        "code": "7700000000000",
        "name": "Москва"
    },
    {
        "code": "7800000000000",
        "name": "Санкт-Петербург"
    },
    {
        "code": "5400000100000",
        "name": "Новосибирск"
    },
    {
        "code": "6600000100000",
        "name": "Екатеринбург"
    },
    {
        "code": "5200000100000",
        "name": "Нижний Новгород"
    },
    {
        "code": "1600000100000",
        "name": "Казань"
    },
    {
        "code": "7400000100000",
        "name": "Челябинск"
    },
    {
        "code": "5500000100000",
        "name": "Омск"
    },
    {
        "code": "6300000100000",
        "name": "Самара"
    },
    {
        "code": "6100000100000",
        "name": "Ростов-на-Дону"
    },
    {
        "code": "0200000100000",
        "name": "Уфа"
    },
    {
        "code": "2400000100000",
        "name": "Красноярск"
    },
    {
        "code": "5900000100000",
        "name": "Пермь"
    },
    {
        "code": "3600000100000",
        "name": "Воронеж"
    },
    {
        "code": "3400000100000",
        "name": "Волгоград"
    },
    {
        "code": "2300000100000",
        "name": "Краснодар"
    },
    {
        "code": "6400000100000",
        "name": "Саратов"
    },
    {
        "code": "7200000100000",
        "name": "Тюмень"
    },
    {
        "code": "6300000700000",
        "name": "Тольятти"
    },
    {
        "code": "1800000100000",
        "name": "Ижевск"
    },
    {
        "code": "2200000100000",
        "name": "Барнаул"
    },
    {
        "code": "7300000100000",
        "name": "Ульяновск"
    },
    {
        "code": "3800000300000",
        "name": "Иркутск"
    },
    {
        "code": "2700000100000",
        "name": "Хабаровск"
    },
    {
        "code": "7600000100000",
        "name": "Ярославль"
    },
    {
        "code": "2500000100000",
        "name": "Владивосток"
    },
    {
        "code": "0500000100000",
        "name": "Махачкала"
    },
    {
        "code": "7000000100000",
        "name": "Томск"
    },
    {
        "code": "5600000100000",
        "name": "Оренбург"
    },
    {
        "code": "4200000900000",
        "name": "Кемерово"
    },
    {
        "code": "4200001200000",
        "name": "Новокузнецк"
    },
    {
        "code": "6200000100000",
        "name": "Рязань"
    },
    {
        "code": "3000000100000",
        "name": "Астрахань"
    },
    {
        "code": "1600000200000",
        "name": "Набережные Челны"
    },
    {
        "code": "5800000100000",
        "name": "Пенза"
    },
    {
        "code": "4800000100000",
        "name": "Липецк"
    },
    {
        "code": "4300000100000",
        "name": "Киров"
    },
    {
        "code": "2100000100000",
        "name": "Чебоксары"
    },
    {
        "code": "7100000100000",
        "name": "Тула"
    },
    {
        "code": "3900000100000",
        "name": "Калининград"
    },
    {
        "code": "5000003600000",
        "name": "Балашиха"
    },
    {
        "code": "4600000100000",
        "name": "Курск"
    },
    {
        "code": "9200000000000",
        "name": "Севастополь"
    },
    {
        "code": "0300000100000",
        "name": "Улан-Удэ"
    },
    {
        "code": "2600000100000",
        "name": "Ставрополь"
    },
    {
        "code": "2300000700000",
        "name": "Сочи"
    },
    {
        "code": "6900000100000",
        "name": "Тверь"
    },
    {
        "code": "7400000900000",
        "name": "Магнитогорск"
    },
    {
        "code": "3700000100000",
        "name": "Иваново"
    },
    {
        "code": "3200000100000",
        "name": "Брянск"
    },
    {
        "code": "3100000100000",
        "name": "Белгород"
    },
    {
        "code": "8600001000000",
        "name": "Сургут"
    },
    {
        "code": "3300000100000",
        "name": "Владимир"
    },
    {
        "code": "6600002300000",
        "name": "Нижний Тагил"
    },
    {
        "code": "2900000100000",
        "name": "Архангельск"
    },
    {
        "code": "7500000100000",
        "name": "Чита"
    },
    {
        "code": "9100000700000",
        "name": "Симферополь"
    },
    {
        "code": "4000000100000",
        "name": "Калуга"
    },
    {
        "code": "6700000300000",
        "name": "Смоленск"
    },
    {
        "code": "3400000200000",
        "name": "Волжский"
    }
]